# jhjn's homebrew
# taps
tap "homebrew/core"
tap "homebrew/cask"
tap "koekeishiya/formulae"
# formulas
brew "bat"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "gnupg"
brew "gnu-sed" , args: ["with-rmtp-module"]--with-default-names
#brew "hub"
brew "imagemagick"
brew "ipython"
brew "mpv"
brew "netcat"
brew "pandoc"
brew "pass"
brew "python"
#brew "ranger"
brew "restic"
brew "ripgrep"
brew "skhd"
#brew "streamlink"
brew "syncthing"
brew "taskwarrior"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yabai"
brew "youtube-dl"
# casks
#cask "blender"
cask "gimp"
cask "inkscape"
cask "iterm2"
cask "hammerspoon"
cask "karabiner-elements"
cask "nextcloud"
cask "qutebrowser"
